Taco_Project/app/controllers/tacos_controller.rb

INSERT INTO "users" ("name", "username", "password", "email", "address", "phone_number", "location_id", "taco_points", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = current_user
    @taco = Taco.new(taco_params)
    if @taco.valid?
      @taco.save
      @user.tacos << @taco