Taco_Project/app/controllers/tacos_controller.rb

def create
  @taco = Taco.create(ingredient_ids:params[:ingredients][:ingredient_id].compact)
---
INSERT INTO "taco_ingredients" ("taco_id", "ingredient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["taco_id", 6], ["ingredient_id", 7], ["created_at", "2018-10-01 18:15:08.192702"], ["updated_at", "2018-10-01 18:15:08.192702"]]
INSERT INTO "tacos" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-10-01 18:15:08.184988"], ["updated_at", "2018-10-01 18:15:08.184988"]]