Taco_Project/app/controllers/users_controller.rb

  def find_user
    @user = User.find_by(username: session[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "pattipig"], ["LIMIT", 1]]